var clild = document.createElement('li');	//До змінної clid, прив'язую тег li
var text = document.createTextNode("Створений об'єкт");	//До text -- текстовий об'єкт.
							//Тепер і тег, і сам текст, закріплені в пам'яті за певними змінними, однак вони ще не виведені.

var parent = document.getElementById('list');	//За змінною parent закріплюю об'єкт що має id='list'
clild.appendChild(text);	//роблю текстовий блок, дочірнім елементом тега. Т.ч. зв'язую їх між собою.
parent.appendChild(clild);	//Роблю змінну clid, тобто вже два зв'язаних об'єкти, дочірніми до змінної parent.
		//						а т.я. ця змінна має інші дочірні елементи, то створений мною з'являється 							наприкінці.
