// console.log("hello"); -- вивести значення в консоль
// alert('hello'); -- вивести значення у віконце
i = 202;
//1-------------------------------------------------------------------------------------------О:Всередині
	//Функція -- по факту, скрипти, що викликаються лише по назві. Тобто скрипти, що чекають виклику.
function count (){	//Оголошуємо функцію
	var num1 = 1;		//Всередині ф-ї, пишу скрипт, котрий буде виконуватися, коли її буде викликано.
	var num2 = 2;
	var num3 = 3;
	
	var sum = num1+num2+num3;
	
	console.log(sum);
}

count();	//Викликаю функцію.









//2-----------------------------------------------------------------------------------О:Всередині+при виклику
function count1 (nam1){	//nam1 -- "порожня" змінна, значення якої задається при її виклику
	
	var nam2 = 2;
	var nam3 = 3;
	
	var sum = nam1+nam2+nam3;
	
	console.log(sum);
}


count1(555);	//Виклик функції, з присвоєнням змінної nаm1 значення 555










//3-------------------------------------------------------------------------------------------О:При виклику
function count2 (na1, na2, na3){	//na -- "порожні" змінні, значення яких задається при її виклику
	
	var sum = na1+na2+na3;
	
	console.log(sum);
}


count2(555, i, 303);	//Виклик функції, з присвоєнням значень усім "порожнім" змінним(присвоїти можна як число, так і змінну)










//4-------------------------------------------------------------------------------------------О:З опер. "або"

function count3 (num1, num2, num3){	//Оголошуємо функцію
	var num1 = num1 || 1 ;		//Якщо, при виклику змінної, якийсь параметр не буде вказано, то замість нього буде підібрано стандартний. Тобто той, що після оператора "або" (||)
	var num2 = num2 || 2 ;
	var num3 = num3 || 3 ;
	
	var sum = num1+num2+num3;
	
	console.log(sum);
}

count3(60000,i);	//Замість n1, ф-я генерує число 60К. Замість n2 - значення і, а в якості n3 бере вказане в функції значення n3.











//--------------------------------RETURN
	//Зберегти результат функції

function count4 (nam1){	
	
	var nam2 = 2;	//Всі змінні функціїї, включно з її результатом є локальними, й видаляються з пам'яті по закінченні функції.
	var nam3 = 3;
	
	var sum = nam1+nam2+nam3;
	console.log(sum);
	return sum;		//Якщо її результат десь треба зберегти, додається параметр return, котрий надає можливість зберегти результат функції, в змінну.
	
	
//Після Return, подальші скрипти функції  не виконуються.
}

var sum200 = count4(555); //Вивід результату відбуваєтья так

console.log('Охрінезна сума:  ' + sum200);	//Показ результату.






//--------------------------------------------------------------------------------------




































































