


// Write JavaScript here 
var _id = document.getElementById('_id'); //Доступаємося до елемента по id.

_id.style.fontSize = "30px"; //Т.я. елемент один, він записався як змінна, а не як масив, тож нічого городити не треба й міняємо його значення одразу.
//1---------------------------------------------------------------------------------------------








var _classArr = document.getElementsByClassName("_class");	//Доступаємося до елемента через клас.

    for(var i = 0; i < _classArr.length; i++){	//Елемент -- масив. А отже, щоб вплинути на всі його значення,
      _classArr[i].style.color = 'red';			//  доведеться будувати скрипт.
    }
//2-------------------------------------------------------------------------------------------------













var tagArr = document.getElementsByTagName("p");	//Доступаємося до елемента через тег.
    for(var g = 0; g < tagArr.length; g++){
      tagArr[g].style.border = 'solid';
    }
//3---------------------------------------------------------------------------------------------------













var inputArr = document.querySelectorAll("input");	//Звертаємося до всіх юнітів на сторінці, котрі якось .
    for(var s = 0; s < inputArr.length; s++){		//		пов'язані з input
      inputArr[s].style.backgroundColor = 'yellow';
    }
//4--------------------------------------------------------------------------------------------------



var inFArr = document.querySelector("input"); //Звертаємося до першого юніта (без ALL)
    
 inFArr.style.border = 'dotted'; //т.я. юніт перший, відповідно, його значення збереглось як змінна, а не як масив. Відповідно, вплинути на нього можна безпосередньо
//5------------------------------------------------------------------------------------------
































