console.log(Number('8,4,5,2'));	//Перетворює стрічку в число
console.log(String(8452));		//Число -- в стрічку
console.log(Boolean(1));		//Перетворює в буловий тип (true/false)

console.log(!!1);				//Перетворює в буловий тип 
console.log(8452+"");			//Число -- в стрічку
console.log(+"8452");			//Перетворює стрічку в число


var num = 22;

console.log(num.toString(10));// в аргументі -- системи числення 
							//(десятична за замовчуванням)

var f = false;
console.log(f);
console.log(f.toString());




console.log(parseInt("45px", 10)); //Перетворює задану 
				//інформацію в числове значення, 
				//ігноруючи усі символи, крім, власне, числ. 
				//Друге значення -- система чилення.
parseFloat()	--	те ж саме, тільки без скорочення./

(num.toFixed(0))	--  округлює число, 
					до вказаної кількості знаків після коми
					й перетворює його в текстове значення

