//if (Умова) {Скрипт};		--	По суті своїй, в ядрі, умова перевіряє вираз на відповідність T/F
var n=8452;

if (n>1){	//Перетворення виразу на T/F, якщо вираз вірний, то відбувається подальший обрахунок
	n*=3;	//n=n*3
	console.log(n);
}

if (n>1){				//if перезаписує значення змінної
	n-=5;	//n=n-5
	console.log(n);
}



if (n>1){				
	n*=-n*2;	//n=n*((-n)*2)
	console.log(n);
}


//-----------------------------------------------------------------------------

n=n;

if (n>1){		//Коли задане в if значення є F, скрипт не виконується. Замість того, ми переходимо в стрічку else		
	n/=n;	
	console.log(n);
} else if (n<1 && n>-100){
	console.log('Значення N в межах -100');
} else if (n<-100 && n>-1000){
	console.log('Значення N в межах -1000');
} else if (n<-1000 && n>-10000){
	console.log('Значення N в межах -10000');
} else {			//В стрічці else, в свою чергу, можна задати ще кілька if-ів, за рахунок чого, зростити об'єм формули.
	console.log('Значення N на стільки низько, що визначити його неможливо.');
}

//------------------------------------------------------------------------------------
//Потрійний оператор

//Якщо умова = Т, скрипт віддає першу частину коду, а якщо F -- другу. 
	//	Це можна використовувати як однокнопочний перемикач.

var x = 80;	//Умова
var texts = x > 10 ? "Якщо умова = True" : "Якщо умова = False";
console.log(texts);










		//Або... _)))))
var x = 10;	//Умова
var texts = x > 10 ? 
		"X>10 " : x < 10 ?
				"X<10":"X=10";
console.log(texts);