!window.open(url, "", "width=640,height=580");
    //  * Відкриває введену адресу у новому вікні
  // url > посилання
  //name > заголовок
  // params > Паоаметри нового вікна:
/*

Значения параметров params.

Настройки расположения окна:
left/top (число) - Координаты верхнего левого угла
width/height (число) - Ширина/высота нового окна.
        > За відсутності:браузер открывает новую вкладку
Свойства окна:

menubar (yes/no) - Скрыть или показать строку меню браузера.
toolbar (yes/no) - Показать или скрыть панель навигации браузера (кнопки назад, вперёд, обновить страницу и остальные) в новом окне.
location (yes/no) - Показать/скрыть поле URL-адреса в новом окне. По умолчанию Firefox и IE не позволяют скрывать строку адреса.
status (yes/no) - Показать или скрыть строку состояния
resizable (yes/no) - Позволяет отключить возможность изменять размеры нового окна. Значение no обычно неудобно посетителям.
scrollbars (yes/no) - Разрешает убрать полосы прокрутки 

*/
 
