



//------------------------------------WHILE



//(Умова, тобто: "доки скрипт працює?")	{скрипт}

var i = 0;	//Змінна і оголошується з початковим значенням нуль



while (i <= 5) {	//Доки і менша п'яти, виконується наступний скрипт:
	console.log(i);		//Спершу виводиться нинішнє значення і
	i++					//Після чого, до і додається одиниця
}
















console.log("---------------------------");//-----------------------------------------------------
//--------------------------------------DO





//Скрипт запускається до оголошення умови. Відповідно, скрипт виконається, мінімум раз, перш ніж дізнається про T/F

var g = 0; //Оголошення змінної



do{	//Запустити
	console.log(g); //Спершу виводиться значення змінної
	g++;			//Потім до неї додається одиниця
} while (g<=6);		//Після чого, умова, просить повторити цей скрипт, доки вона не виконається



console.log("---------------------------");//-----------------------------------------













//--------------------------------------FOR 

//(Задано; Умова T/F; Інкремент, тобто дія з умовою){скрипт}



for(var o = 0; o < 3; o++){		//Спершу о=0; Потім задається умова Доки; після чого встановлюється крок
	console.log(o);
	
}



console.log("---------------------------");//-------------------------------------

const euros = [29.76, 41.85, 46.5];
const sum = euros.reduce((total, amount) => total + amount); 







//---------------------------------інші варіанти



while (true) {	//"Якщо..."	"Так!"	-- Цикл без вказаного завершення
	var value = prompt('Введи число', '');	//Promt - викликає вікно для вводу тексту
		if (value == null){		//Якщо значення відсутнє
			break;				//Перервати цикл.
		}
	
	console.log(value);
}






console.log("---------------------------");






for(var as=10000; as > 9994; as-- ){	//Від 10 000, до 9 995. Віднімати по одному значенні
	if (as===9999){			//Коли змінна рівна 9999, то
		continue			//Пропустити цей шматок цикла
	}
	console.log(as);
}






console.log("---------------------------");

























































