



var subj = {	//Змінна до якої присвоюється об'єкт
//----------------------------------------------------------------------------------Уся 
	type: "Human",		//В області "скрипт", знаходяться значення об'єкта			ця
	old: 66,				//	й його індентифікатори								конструкція
	validity: true,											//						є
	tex: function() {return "Виконано!";},					//						об'єктом
//-----------------------------------------------------------------------------------------
}




//Маніпуляції з об'єктом
console.log(subj.type);	//Звернення до індентифікатора об'єкта
console.log(subj["validity"]);	//Звернення до індентифікатора об'єкта
console.log(subj["name"] +' Доданий текст');	//Виклик відсутнього інд.
subj.name = "Гжигош";		//Додаємо інд. в об'єкт
console.log(subj["name"] +' доданий текст');	//Виклик раніше відсутнього інд.

subj._ids = 8457;
console.log(subj);			//Виклик усього масиву для перечня інад. об'єкта
console.log(subj.tex());	//Виклик функції-інд. об'єкта

delete subj.old	//Видалити інд. old
console.log(subj);	